## Exercises II

Let's set up an example scenario as perspective for our regression exercises using the Zillow dataset.

As a Codeup data science graduate, you want to show off your skills to the Zillow data science team in hopes of getting an interview for a position you saw pop up on LinkedIn. You thought it might look impressive to build an end-to-end project in which you use some of their Kaggle data to predict property values using some of their available features; who knows, you might even do some feature engineering to blow them away. Your goal is to predict the values of single unit properties using the obervations from 2017.

In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Zillow data from the zillow database in the Codeup database server.

1. Acquire `bedroomcnt`, `bathroomcnt`, `calculatedfinishedsquarefeet`, `taxvaluedollarcnt`, `yearbuilt`, `taxamount`, and `fips` from the `zillow` database for all 'Single Family Residential' properties.
1. Using your acquired Zillow data, walk through the summarization and cleaning steps in your `wrangle.ipynb` file like we did above. You may handle the missing values however you feel is appropriate and meaninful; remember to document your process and decisions using markdown and code commenting where helpful.
1. Store all of the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe witn no missing values in your `wrangle.py` file. Name your final function `wrangle_zillow`.

In [1]:
import pandas as pd
import env

In [2]:
def get_connection(db, username=env.username, host=env.host, password=env.password):
    '''
    This function takes in as arguments the database, username, host, and password for 
    the mysql database and returns a string that can be used to open a connection to the server
    and query the db in the read_sql function. 
    '''
    return f'mysql+pymysql://{username}:{password}@{host}/{db}'

In [8]:
# get data from mysql database
def new_zillow_data():
    '''
    This function takes in no arguments, uses the get_connection() function 
    and returns the mysql zillow.properties_2017 table in the form of a dataframe. 
    '''
    return pd.read_sql('select bedroomcnt,bathroomcnt, calculatedfinishedsquarefeet,\
                        taxvaluedollarcnt, yearbuilt, taxamount, fips FROM zillow.properties_2017\
                        where propertylandusetypeid = 261',\
                       get_connection('zillow'))
new_zillow_data().head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [32]:
raw_data = new_zillow_data()
df = raw_data.copy()

In [34]:
# check rows 
df.shape

(2152863, 7)

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
bedroomcnt,2152852.0,3.287196,0.954754,0.00,3.00,3.00,4.00,25.00
bathroomcnt,2152852.0,2.230688,0.999280,0.00,2.00,2.00,3.00,32.00
calculatedfinishedsquarefeet,2144379.0,1862.855178,1222.125124,1.00,1257.00,1623.00,2208.00,952576.00
taxvaluedollarcnt,2152370.0,461896.237963,699676.049600,1.00,188170.25,327671.00,534527.00,98428909.00
yearbuilt,2143526.0,1960.949681,22.162196,1801.00,1949.00,1958.00,1976.00,2016.00
taxamount,2148421.0,5634.865978,8178.910249,1.85,2534.98,4108.95,6414.32,1337755.86
fips,2152863.0,6048.377335,20.433292,6037.00,6037.00,6037.00,6059.00,6111.00

In [20]:
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152863 entries, 0 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 115.0 MB

In [36]:
df.shape

(2152863, 7)

In [47]:
# use different columns to check the white space
df.fips.value_counts()

6037    1425207
6059     552057
6111     162971
Name: fips, dtype: int64

In [37]:
# check null value
df.isnull().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [38]:
# drop null value
df = df.dropna()
df.shape

(2140235, 7)

In [39]:
# check again
df.isnull().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [40]:
# convert columns data type
df[['bedroomcnt','bathroomcnt', 'calculatedfinishedsquarefeet','taxvaluedollarcnt',\
        'yearbuilt', 'fips']] = df[['bedroomcnt','bathroomcnt', 'calculatedfinishedsquarefeet','taxvaluedollarcnt',\
        'yearbuilt', 'fips']].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    int64
 1   bathroomcnt                   int64
 2   calculatedfinishedsquarefeet  int64
 3   taxvaluedollarcnt             int64
 4   yearbuilt                     int64
 5   taxamount                     float64
 6   fips                          int64
dtypes: float64(1), int64(6)
memory usage: 130.6 MB

In [55]:
# function of wrangle zillow data
def wrangle_zillow():
    df = new_zillow_data()
    df = df.dropna()
    df[['bedroomcnt','bathroomcnt', 'calculatedfinishedsquarefeet','taxvaluedollarcnt',\
        'yearbuilt', 'fips']] = df[['bedroomcnt','bathroomcnt', 'calculatedfinishedsquarefeet','taxvaluedollarcnt',\
        'yearbuilt', 'fips']].astype('int')
    
    return df

In [56]:
# test out
df1 = wrangle_zillow()
df1.shape

(2140235, 7)

In [3]:
# test with import wrangle

import wrangle

df2 = wrangle.wrangle_zillow()
df2.shape

(2140235, 7)